Autodesk.Revit.DB.DirectShape.IsValidShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type.
shape:
Shape of this object expressed as a collection of GeometryObjects.
For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType:
The view type this shape is intended for.
Returns:
True if the supplied shape passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.DirectShape.IsValidShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Validates shape to be stored in a DirectShape. Supercedes and extends IsValidGeometry().
Remarks:
This function calls IsValidShape(GeometryObject) to validate each object in the list.
shape:
Shape to be validated represented as a collection of GeometryObjects.
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
Returns:
True if the supplied shape passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectShape.IsValidGeometry(Autodesk.Revit.DB.Solid)
Validates geometry to be stored in a DirectShape. Suitable geometry validation is performed. Additionally, the geometry
must make sense as a shape representation for the category assigned to this DirectShape object.
Geom:
GeometryObject to be validated.
Returns:
True if the supplied GeometryObject passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.IsValidTypeId(Autodesk.Revit.DB.ElementId)
Tests the type id to make sure it satisfies the following conditions
It is a valid element id.It corresponds to a valid DirectShapeType.The DirectShapeType has the same category assigned.
Additionally, this functions tests that the current type id in this DirectShape is invalid.
The type id is initialized to invalidElementId by the create functions. Once it is set, it may no longer be changed.
typeId:
Type id to be tested.
Returns:
False unless typeId satisfies the conditions listed above and the type id of this object was not set previously.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.IsSupportedDocument(Autodesk.Revit.DB.Document)
Tests whether a DirectShape or a DirectShapeType may be created in this document.
Remarks:
Some types of Document, such as 2D families, can't support DirectShape functionality.
document:
Document to be tested.
Returns:
True if a DirectShape or a DirectShapeType object can be created in this document, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectShape.IsValidCategoryId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Test the category id to make sure it is indeed a top-level built-in category.
categoryId:
Category id to be tested.
doc:
Document to look up the category by id.
Returns:
False unless categoryId corresponds to a valid built-in top-level model category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.GetOptions
Gets a copy of the current options for this DirectShape.
Returns:
Options currently set for this DirectShape.
Since:
2016

Autodesk.Revit.DB.DirectShape.SetOptions(Autodesk.Revit.DB.DirectShapeOptions)
Sets the options to use for this DirectShape.
Remarks:
The new options take effect immediately.
If this DirectShape relies on a DirectShapeType for references, the options stored in DirectShapeType take precedence.
Note that changing options affects how the object interacts with Revit. E.g., switching references off will disable
existing constraints applied to that object.
options:
Options to use for this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The DirectShapeOptions provided are not valid for this DirectShape.
-or-
The DirectShapeOptions provided are not valid for this transient DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.AreOptionsValidForTransientDirectShape(Autodesk.Revit.DB.DirectShapeOptions)
Validates that the given DirectShapeOptions are allowed if this DirectShape is transient.
options:
The options object.
Returns:
True if the DirectShapeOptions are valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.AreOptionsValid(Autodesk.Revit.DB.DirectShapeOptions)
Validates that the given DirectShapeOptions are allowed for this particular DirectShape.
options:
The options object.
Returns:
True if the DirectShapeOptions are valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.AppendShape(Autodesk.Revit.DB.ShapeBuilder)
Appends shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape.
The data stored in the supplied ShapeBuilder object will be cleared.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
This function will bypass extra geometry validation because the built geometry has already been validated by the ShapeBuilder.
It is therefore slightly more efficient than the AppendShape() routine that accepts GeometryObjects directly as input.
ShapeBuilder:
The ShapeBuilder object that was used to build the shape to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.AppendShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShape.
Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of GeometryObjects.
For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType:
Passing DirectShapeTargetViewType.Default as view type will cause the default shape to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShape validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DirectShape.AppendShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of GeometryObjects.
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShape validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.SetShape(Autodesk.Revit.DB.ShapeBuilder)
Sets the shape of this object to the one accumulated in the supplied Builder object.
If the new shape is identical to the old one, the old shape will be kept.
Remarks:
This function will bypass extra geometry validation because the built geometry has already been validated by the ShapeBuilder.
It is therefore slightly more efficient than the SetShape() routine that accepts GeometryObjects directly as input.
Supplying a ViewShapeBuilder object as argument will cause the view-specific shape of this DirectShape to be updated.
Supplying other ShapeBuilder types will update the model shape.
pBuilder:
A ShapeBuilder object that was used to successfully build geometry to store in this DirectShape.
The built shape will be transferred to the DirectShape, and the ShapeBuilder object will be reset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.SetShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied.
If the new shape is identical to the old one, the old shape will be kept.
pGeomArr:
Shape of this object expressed as a collection of GeometryObjects.
For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType:
Optional: set a view-specific shape representation that will be used in views of that type only.
Passing DirectShapeTargetViewType::Default as view type will cause the default shape to be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShape validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DirectShape.SetShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied.
If the new shape is identical to the old one, the old shape will be kept.
pGeomArr:
Shape of this object expressed as a collection of GeometryObjects.
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShape validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.SetName(System.String)
Sets the name for the DirectShape element.
name:
The name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.SetTypeId(Autodesk.Revit.DB.ElementId)
Sets the DirectShapeType for the DirectShape element.
typeId:
The ID of the type corresponding to this DirectShape element. May only be set once.
Throws Autodesk.Revit.Exceptions.ArgumentException:
typeId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.CreateElementInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.String,Autodesk.Revit.DB.Transform)
Creates a DirectShape object and adds it to document.
Remarks:
This function is included for convenience. It essentially combines CreateGeometryInstance and CreateElement.
The shape stored in the element is either a reference or a copy of a definition shape that was created earlier.
How the definitions are stored will determine whether an instance or a copy of the shape will be created.
The intended use is to support a definition/instance pattern common in CAD formats - DWG blocks, STEP MAPPED_ITEM, IFC IfcMappedItem.
Use DirectShapeLibrary class to store definitions prior to using them here.
document:
Document to which the created element will be added.
typeId:
Element id of a DirectShapeType element.
categoryId:
Id of the category assigned to this DirectShape. Must be a valid category id.
definitionId:
Id of the shape definition that was created earlier and stored via DirectShapeLibrary.
trf:
Transform to be applied to the definition.
Returns:
The created DirectShape object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Document document may not contain DirectShape or DirectShapeType objects.
-or-
Element id categoryId may not be used as a DirectShape category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectShape.CreateGeometryInstance(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Transform)
Creates a copy of a definition shape that was created earlier.
Remarks:
Use DirectShapeLibrary class to store definitions prior to using them here.
How the definitions are stored will determine whether an instance or a copy of the shape will be created.
Use the output of this function as input to CreateElement to make the created shape persistent.
This is intended to support a definition/instance pattern common in CAD formats - DWG blocks, STEP MAPPED_ITEM, IFC IfcMappedItem.
document:
Document to which the created element will be added
definition_id:
ID of the shape definition that was created earlier and stored via DirectShapeLibrary
trf:
Transform to be applied to the definition
Returns:
A collection of GeometryObjects representing a placed instance of the pre-defined shape
The caller function takes ownership
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.CreateElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a DirectShape object and adds it to document.
document:
Document to which the created element will be added.
categoryId:
Id of the category assigned to this DirectShape. Must be a valid category id.
Returns:
The created DirectShape object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Document document may not contain DirectShape or DirectShapeType objects.
-or-
Element id categoryId may not be used as a DirectShape category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectShape.ApplicationDataId
A text string that identifies the data to the creating application.
Remarks:
The intended use is to enable the creating application to identify the native data that was the source of this DirectShape.
However, the creating application may use any text string as appropriate for its purposes, or leave this property unset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectShape.ApplicationId
A text string that identifies the creating application.
Remarks:
The creating application may use any text string as appropriate for its purposes, or leave this property unset.
One option is to use Application.ActiveAddInId for a unique application id, or concatenate it with an application name for a more informative, but still unique id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectShape.TypeId
Element id of a DirectShapeType object that holds properties to be shared by this element. Optional.
Since:
2015

Autodesk.Revit.DB.DirectShape
This class is used to store externally created geometric shapes. Primary intended use is for importing shapes from other data formats such as IFC or STEP.
A DirectShape object may be assigned a category. That will affect how that object is displayed in Revit.
Remarks:
DirectShape is not a replacement for "real" Wall, Roof, Window, etc. It would typically be used  where there is not enough information
to create, e.g., a Wall, or full functionality of a Wall object is not needed. Some category-specific functionality may be available.
If you need to modify a shape held by a DirectShape object, use Revit Geometry API, and then store the modified shape back to the DirectShape object.
Since:
2015